src/test/resources/requests/invalid-request-2.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:sim="http://www.example.org/SimpleSchema/">
    <soapenv:Header/>
    <soapenv:Body>
        <sim:SomeOperation>
            <SomeString>?</SomeString>
            <SomeDate>2010qq-11-11</SomeDate>
            <SomeInteger>111</SomeInteger>
        </sim:SomeOperation>
    </soapenv:Body>
</soapenv:Envelope>